tests/fixtures/vcr_cassettes/6_7/get_virtual_machine.yml

---
http_interactions:
- request:
    method: post
    uri: https://<%= vsphere_server %>/sdk
    body:
      encoding: UTF-8
      string: <env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><env:Body><RetrieveProperties
        xmlns="urn:vim25"><_this type="PropertyCollector">propertyCollector</_this><specSet
        xsi:type="PropertyFilterSpec"><propSet xsi:type="PropertySpec"><type>Folder</type><pathSet>childEntity</pathSet></propSet><objectSet
        xsi:type="ObjectSpec"><obj type="Folder">group-d1</obj></objectSet></specSet></RetrieveProperties></env:Body></env:Envelope>
    headers:
      Content-Type:
      - text/xml; charset=utf-8
      Soapaction:
      - urn:vim25/6.7
      Cookie:
      - vmware_soap_session="6e48b88ae9980b685080edda807256dac6f3d849"; Path=/; HttpOnly;
        Secure;
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 16 Apr 2019 23:44:58 GMT
      Cache-Control:
      - no-cache
      Connection:
      - Keep-Alive
      Content-Type:
      - text/xml; charset=utf-8
      X-Frame-Options:
      - DENY
      Content-Length:
      - '666'
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?>
        <soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
         xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
         xmlns:xsd="http://www.w3.org/2001/XMLSchema"
         xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        <soapenv:Body>
        <RetrievePropertiesResponse xmlns="urn:vim25"><returnval><obj type="Folder">group-d1</obj><propSet><name>childEntity</name><val xsi:type="ArrayOfManagedObjectReference"><ManagedObjectReference type="Datacenter" xsi:type="ManagedObjectReference">datacenter-2</ManagedObjectReference></val></propSet></returnval></RetrievePropertiesResponse>
        </soapenv:Body>
        </soapenv:Envelope>
    http_version:
  recorded_at: Tue, 16 Apr 2019 23:44:58 GMT
- request:
    method: post
    uri: https://<%= vsphere_server %>/sdk
    body:
      encoding: UTF-8
      string: <env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><env:Body><RetrieveProperties
        xmlns="urn:vim25"><_this type="PropertyCollector">propertyCollector</_this><specSet
        xsi:type="PropertyFilterSpec"><propSet xsi:type="PropertySpec"><type>Datacenter</type><pathSet>name</pathSet></propSet><objectSet
        xsi:type="ObjectSpec"><obj type="Datacenter">datacenter-2</obj></objectSet></specSet></RetrieveProperties></env:Body></env:Envelope>
    headers:
      Content-Type:
      - text/xml; charset=utf-8
      Soapaction:
      - urn:vim25/6.7
      Cookie:
      - vmware_soap_session="6e48b88ae9980b685080edda807256dac6f3d849"; Path=/; HttpOnly;
        Secure;
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 16 Apr 2019 23:44:58 GMT
      Cache-Control:
      - no-cache
      Connection:
      - Keep-Alive
      Content-Type:
      - text/xml; charset=utf-8
      X-Frame-Options:
      - DENY
      Content-Length:
      - '538'
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?>
        <soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
         xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
         xmlns:xsd="http://www.w3.org/2001/XMLSchema"
         xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        <soapenv:Body>
        <RetrievePropertiesResponse xmlns="urn:vim25"><returnval><obj type="Datacenter">datacenter-2</obj><propSet><name>name</name><val xsi:type="xsd:string">BRQ</val></propSet></returnval></RetrievePropertiesResponse>
        </soapenv:Body>
        </soapenv:Envelope>
    http_version:
  recorded_at: Tue, 16 Apr 2019 23:44:58 GMT
- request:
    method: post
    uri: https://<%= vsphere_server %>/sdk
    body:
      encoding: UTF-8
      string: <env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><env:Body><FindByUuid
        xmlns="urn:vim25"><_this type="SearchIndex">SearchIndex</_this><datacenter
        type="Datacenter">datacenter-2</datacenter><uuid>52d810bd-077b-368d-a86f-0b2ad84269f8</uuid><vmSearch>1</vmSearch><instanceUuid>1</instanceUuid></FindByUuid></env:Body></env:Envelope>
    headers:
      Content-Type:
      - text/xml; charset=utf-8
      Soapaction:
      - urn:vim25/6.7
      Cookie:
      - vmware_soap_session="6e48b88ae9980b685080edda807256dac6f3d849"; Path=/; HttpOnly;
        Secure;
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 16 Apr 2019 23:44:58 GMT
      Cache-Control:
      - no-cache
      Connection:
      - Keep-Alive
      Content-Type:
      - text/xml; charset=utf-8
      X-Frame-Options:
      - DENY
      Content-Length:
      - '436'
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?>
        <soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
         xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
         xmlns:xsd="http://www.w3.org/2001/XMLSchema"
         xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        <soapenv:Body>
        <FindByUuidResponse xmlns="urn:vim25"><returnval type="VirtualMachine">vm-22</returnval></FindByUuidResponse>
        </soapenv:Body>
        </soapenv:Envelope>
    http_version:
  recorded_at: Tue, 16 Apr 2019 23:44:58 GMT
- request:
    method: post
    uri: https://<%= vsphere_server %>/sdk
    body:
      encoding: UTF-8
      string: <env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><env:Body><RetrieveProperties xmlns="urn:vim25"><_this type="PropertyCollector">propertyCollector</_this><specSet xsi:type="PropertyFilterSpec"><propSet xsi:type="PropertySpec"><type>VirtualMachine</type><pathSet>config.instanceUuid</pathSet><pathSet>name</pathSet><pathSet>config.uuid</pathSet><pathSet>config.template</pathSet><pathSet>parent</pathSet><pathSet>summary.guest.hostName</pathSet><pathSet>summary.guest.guestFullName</pathSet><pathSet>guest.ipAddress</pathSet><pathSet>runtime.powerState</pathSet><pathSet>runtime.connectionState</pathSet><pathSet>runtime.host</pathSet><pathSet>guest.toolsStatus</pathSet><pathSet>guest.toolsVersionStatus</pathSet><pathSet>config.hardware.memoryMB</pathSet><pathSet>config.hardware.numCPU</pathSet><pathSet>config.hardware.device</pathSet><pathSet>guest.disk</pathSet><pathSet>config.hardware.numCoresPerSocket</pathSet><pathSet>overallStatus</pathSet><pathSet>config.guestId</pathSet><pathSet>config.version</pathSet><pathSet>config.cpuHotAddEnabled</pathSet><pathSet>config.memoryHotAddEnabled</pathSet><pathSet>config.firmware</pathSet><pathSet>config.bootOptions.bootOrder</pathSet><pathSet>config.annotation</pathSet><pathSet>config.extraConfig</pathSet></propSet><objectSet xsi:type="ObjectSpec"><obj type="VirtualMachine">vm-22</obj></objectSet></specSet></RetrieveProperties></env:Body></env:Envelope>
    headers:
      Content-Type:
      - text/xml; charset=utf-8
      Soapaction:
      - urn:vim25/6.7
      Cookie:
      - vmware_soap_session="6e48b88ae9980b685080edda807256dac6f3d849"; Path=/; HttpOnly;
        Secure;
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 16 Apr 2019 23:44:58 GMT
      Cache-Control:
      - no-cache
      Connection:
      - Keep-Alive
      Content-Type:
      - text/xml; charset=utf-8
      X-Frame-Options:
      - DENY
      Content-Length:
      - '2859'
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?>
        <soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
         xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
         xmlns:xsd="http://www.w3.org/2001/XMLSchema"
         xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        <soapenv:Body>
        <RetrievePropertiesResponse xmlns="urn:vim25"><returnval><obj type="VirtualMachine">vm-22</obj><propSet><name>config.annotation</name><val xsi:type="xsd:string"></val></propSet><propSet><name>config.bootOptions.bootOrder</name><val xsi:type="ArrayOfVirtualMachineBootOptionsBootableDevice"></val></propSet><propSet><name>config.cpuHotAddEnabled</name><val xsi:type="xsd:boolean">false</val></propSet><propSet><name>config.firmware</name><val xsi:type="xsd:string">bios</val></propSet><propSet><name>config.guestId</name><val xsi:type="xsd:string">windows9Server64Guest</val></propSet><propSet><name>config.hardware.memoryMB</name><val xsi:type="xsd:int">4096</val></propSet><propSet><name>config.hardware.numCPU</name><val xsi:type="xsd:int">2</val></propSet><propSet><name>config.hardware.numCoresPerSocket</name><val xsi:type="xsd:int">1</val></propSet><propSet><name>config.instanceUuid</name><val xsi:type="xsd:string">52d810bd-077b-368d-a86f-0b2ad84269f8</val></propSet><propSet><name>config.memoryHotAddEnabled</name><val xsi:type="xsd:boolean">false</val></propSet><propSet><name>config.template</name><val xsi:type="xsd:boolean">false</val></propSet><propSet><name>config.uuid</name><val xsi:type="xsd:string">564d88d6-2aea-1c8e-826e-1f0dbc536ae6</val></propSet><propSet><name>config.version</name><val xsi:type="xsd:string">vmx-11</val></propSet><propSet><name>guest.ipAddress</name><val xsi:type="xsd:string">10.43.135.241</val></propSet><propSet><name>guest.toolsStatus</name><val xsi:type="VirtualMachineToolsStatus">toolsOk</val></propSet><propSet><name>guest.toolsVersionStatus</name><val xsi:type="xsd:string">guestToolsCurrent</val></propSet><propSet><name>name</name><val xsi:type="xsd:string">DC1</val></propSet><propSet><name>overallStatus</name><val xsi:type="ManagedEntityStatus">green</val></propSet><propSet><name>parent</name><val type="Folder" xsi:type="ManagedObjectReference">group-v3</val></propSet><propSet><name>runtime.connectionState</name><val xsi:type="VirtualMachineConnectionState">connected</val></propSet><propSet><name>runtime.host</name><val type="HostSystem" xsi:type="ManagedObjectReference">host-9</val></propSet><propSet><name>runtime.powerState</name><val xsi:type="VirtualMachinePowerState">poweredOn</val></propSet><propSet><name>summary.guest.guestFullName</name><val xsi:type="xsd:string">Microsoft Windows Server 2016 (64-bit)</val></propSet><propSet><name>summary.guest.hostName</name><val xsi:type="xsd:string">dc01.tfm.brq</val></propSet></returnval></RetrievePropertiesResponse>
        </soapenv:Body>
        </soapenv:Envelope>
    http_version:
  recorded_at: Tue, 16 Apr 2019 23:44:58 GMT
- request:
    method: post
    uri: https://<%= vsphere_server %>/sdk
    body:
      encoding: UTF-8
      string: <env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><env:Body><RetrieveProperties
        xmlns="urn:vim25"><_this type="PropertyCollector">propertyCollector</_this><specSet
        xsi:type="PropertyFilterSpec"><propSet xsi:type="PropertySpec"><type>HostSystem</type><pathSet>name</pathSet></propSet><objectSet
        xsi:type="ObjectSpec"><obj type="HostSystem">host-9</obj></objectSet></specSet></RetrieveProperties></env:Body></env:Envelope>
    headers:
      Content-Type:
      - text/xml; charset=utf-8
      Soapaction:
      - urn:vim25/6.7
      Cookie:
      - vmware_soap_session="6e48b88ae9980b685080edda807256dac6f3d849"; Path=/; HttpOnly;
        Secure;
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 16 Apr 2019 23:44:58 GMT
      Cache-Control:
      - no-cache
      Connection:
      - Keep-Alive
      Content-Type:
      - text/xml; charset=utf-8
      X-Frame-Options:
      - DENY
      Content-Length:
      - '568'
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?>
        <soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
         xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
         xmlns:xsd="http://www.w3.org/2001/XMLSchema"
         xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        <soapenv:Body>
        <RetrievePropertiesResponse xmlns="urn:vim25"><returnval><obj type="HostSystem">host-9</obj><propSet><name>name</name><val xsi:type="xsd:string">esxi.example.com</val></propSet></returnval></RetrievePropertiesResponse>
        </soapenv:Body>
        </soapenv:Envelope>
    http_version:
  recorded_at: Tue, 16 Apr 2019 23:44:59 GMT
- request:
    method: post
    uri: https://<%= vsphere_server %>/sdk
    body:
      encoding: UTF-8
      string: <env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><env:Body><RetrieveProperties
        xmlns="urn:vim25"><_this type="PropertyCollector">propertyCollector</_this><specSet
        xsi:type="PropertyFilterSpec"><propSet xsi:type="PropertySpec"><type>ManagedEntity</type><pathSet>name</pathSet><pathSet>parent</pathSet></propSet><objectSet
        xsi:type="ObjectSpec"><obj type="Folder">group-v3</obj><selectSet xsi:type="TraversalSpec"><name>tsME</name><type>ManagedEntity</type><path>parent</path><skip>0</skip><selectSet
        xsi:type="SelectionSpec"><name>tsME</name></selectSet></selectSet></objectSet></specSet></RetrieveProperties></env:Body></env:Envelope>
    headers:
      Content-Type:
      - text/xml; charset=utf-8
      Soapaction:
      - urn:vim25/6.7
      Cookie:
      - vmware_soap_session="6e48b88ae9980b685080edda807256dac6f3d849"; Path=/; HttpOnly;
        Secure;
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 16 Apr 2019 23:44:58 GMT
      Cache-Control:
      - no-cache
      Connection:
      - Keep-Alive
      Content-Type:
      - text/xml; charset=utf-8
      X-Frame-Options:
      - DENY
      Content-Length:
      - '1019'
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?>
        <soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
         xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
         xmlns:xsd="http://www.w3.org/2001/XMLSchema"
         xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        <soapenv:Body>
        <RetrievePropertiesResponse xmlns="urn:vim25"><returnval><obj type="Folder">group-v3</obj><propSet><name>name</name><val xsi:type="xsd:string">vm</val></propSet><propSet><name>parent</name><val type="Datacenter" xsi:type="ManagedObjectReference">datacenter-2</val></propSet></returnval><returnval><obj type="Datacenter">datacenter-2</obj><propSet><name>name</name><val xsi:type="xsd:string">BRQ</val></propSet><propSet><name>parent</name><val type="Folder" xsi:type="ManagedObjectReference">group-d1</val></propSet></returnval><returnval><obj type="Folder">group-d1</obj><propSet><name>name</name><val xsi:type="xsd:string">Datacenters</val></propSet></returnval></RetrievePropertiesResponse>
        </soapenv:Body>
        </soapenv:Envelope>
    http_version:
  recorded_at: Tue, 16 Apr 2019 23:44:59 GMT
recorded_with: VCR 4.0.0
